{
    "first_name": "Jakub",
    "last_name": "Rada",
    "titles": [
        "AI/ML Master student",
        "Researcher",
        "Software Engineer"
    ],
    "date_of_birth": {
        "name": "Date of birth",
        "icon": "fa-solid fa-cake-candles",
        "year": 2000,
        "month": 2,
        "day": 25
    },
    "age": {
        "name": "Age",
        "icon": "fa-solid fa-calendar-days"
    },
    "location": {
        "name": "Location",
        "icon": "fa-solid fa-map-location-dot",
        "city": "Prague",
        "country": "Czechia",
        "flexible": true
    },
    "contacts": [
        {
            "service": "Phone number",
            "icon": "fa-solid fa-mobile",
            "username": "+420 604 730 409",
            "link": "+420 604 730 409",
            "use": true
        },
        {
            "service": "Email address",
            "icon": "fa-solid fa-envelope",
            "username": "dev.jakubrada@icloud.com",
            "link": "mailto:dev.jakubrada@icloud.com",
            "use": true
        },
        {
            "service": "GitHub",
            "icon": "fa-brands fa-github",
            "username": "radajakub",
            "link": "https://github.com/radajakub",
            "use": true
        },
        {
            "service": "LinkedIn",
            "icon": "fa-brands fa-linkedin",
            "username": "radajakub",
            "link": "https://www.linkedin.com/in/radajakub",
            "use": true
        },
        {
            "service": "Discord",
            "icon": "fa-brands fa-discord",
            "username": "",
            "link": "",
            "use": false
        },
        {
            "service": "LeetCode",
            "icon": "",
            "username": "jakubrada",
            "link": "https://leetcode.com/jakubrada/",
            "use": false
        },
        {
            "service": "HackerRank",
            "icon": "fa-brands fa-hacckerrank",
            "username": "jakubrada",
            "link": "https://hackerrank.com/jakubrada/",
            "use": false
        },
        {
            "service": "Kaggle",
            "icon": "fa-brands fa-kaggle",
            "username": "radajakub",
            "link": "https://www.kaggle.com/jakubrada/",
            "use": false
        }
    ],
    "aboutme": {
        "paragraphs": [
            "I am a Computer Science Master student specializing in Artificial Intelligence at Czech Technical University at Prague. My journey to this field started when I was very young. I started programming when I was 8 in a programming language called Baltie 3. It is a graphical programming language which was specifically designed to teach children how to code in C. Instead of writing code as a text, children drag and connect blocks which represent individual keywords and commands of the C language (and some more to make it easier) to create programs. This language was one of the things that inspired MIT professors to create the well-known language Scratch. I regularly competed at competitions on regional and national level and when I was 11 I ended up second in the national round in the Czech Republic and then placed third in the international round, which comprised the whole central Europe (mostly Czech Republic, Slovakia, Hungary and Poland).",
            "I attended one of the best general high schools in the Czech Republic and I graduated with straight A's from Math, Computer Science and the Czech language. Right after finishing high school I got accepted to the Faculty of Electrical Engineering at Czech Technical University in Prague, which is regarded as the best Computer Science faculty in the Czech Republic. I chose to specialize in Artificial Intelligence as it was the most theoretical specialization. In June 2022, I graduated from the Bachelor programme with honors. Moreover, my Bachelor thesis titled Comparing Exploration Methods in Partially Observable Stochastic Games received the dean's award for exceptional theses. Now, I study a third semester of a Master programme with the same specialization. During the first year of Master's I went to an exchange programme to the Korean Advanced Institute of Science and Technology (KAIST), which is regarded as the best technical university in South Korea. There, I studied in depth Reinforcement Learning, Quantum Computing, Grapm Machine Learning and Compiler Design.",
            "During my studies I participated in an research project in the field of discrete optimization. Our two-member team participated at an international competition ROADEF 2020 consisting of more than 70 international teams and which is regularly organized by the EURO association. In a tough competition, we placed second in the junior cathegory. The paper about our solution was then published in the Journal of Heuristics on Springer. Also, I worked and work as a part-time software engineer in SWEHQ. I worked in development of complex web and mobile applications using mainly Typescript, Angular, NodeJS and most importantly Flutter.",
            "My areas of interest are Artificial Intelligence, machine learning, optimization and computer science in general. I enjoy programming in C/C++, Julia, Haskell and Python but other languages are definitely not an obstacle for me. I never want to stop learning.",
            "Outside of Artificial Intelligence and Computer Science I enjoy sports, mainly running and recently weightlifiting, reading books, travelling and learning new things. I have been running sice I was 6 years old with only short pauses caused by injuries. Now, I specialize in longer distances from 5km to Half-Marathons. As my biggest achievements in the sport I consider a time 34:42 at 10km distance and 1:18:54 at Half-Marathon. I ran the second time in South Korea during my exchange and it put me on 10th place at the International Daegu Half-Marathon only two weeks after winning a Marathon relay for two during the Seoul Marathon 2023."
        ]
    },
    "skills": [
        {
            "category": "Languages",
            "icon": "fa-solid fa-language",
            "skills": [
                "Czech",
                "English",
                "Spanish"
            ]
        },
        {
            "category": "Interests",
            "icon": "fa-solid fa-dumbbell",
            "skills": [
                "running",
                "programming",
                "gym",
                "reading",
                "learning",
                "rap music"
            ]
        },
        {
            "category": "Programming",
            "icon": "fa-solid fa-code",
            "skills": [
                "C/C++",
                "Julia",
                "Python",
                "Rust",
                "Haskell",
                "Java",
                "Typescript",
                "Dart"
            ]
        },
        {
            "category": "Application Frameworks",
            "icon": "fa-brands fa-app-store-ios",
            "skills": [
                "Flutter",
                "Web",
                "Angular",
                "Vue.js",
                "Node.js",
                "Django"
            ]
        },
        {
            "category": "AI/ML tools",
            "icon": "fa-solid fa-brain",
            "skills": [
                "PyTorch",
                "Scikit-learn",
                "DeepMind Control Suite"
            ]
        },
        {
            "category": "Skills and traits",
            "icon": "fa-solid fa-person",
            "skills": [
                "Adaptability",
                "Precision",
                "Quick learning",
                "Attention to detail",
                "Clean code"
            ]
        }
    ]
}
